<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />









  <meta name="360-site-verification" content="2ebfa6bfe0988ac65c00405e3012ab01" />




  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="李开复,筑梦者,向死而生,高晓松纪录片,北京首映礼" />





  <link rel="alternate" href="/atom.xml" title="自由" type="application/atom+xml" />









<meta name="description" content="今天早上看了优酷头条上高晓松导演的关于开复老师的记录片“筑梦者之李开复《向死而生》”，看的过程中几度落泪，同情？不，应该是共鸣，某些言语上的共鸣，开复老师在事业上面无疑是很成功的，试问当今还有谁能够达到他做的这些：28岁获得卡内基梅隆大学计算机系博学位，发表的论文被授予“最重要科学创新奖”，之后苹果副总裁、微软副总裁、google副总裁，再到09年创办创新工场，帮助年轻人实现梦想！可是，在这些光环">
<meta property="og:type" content="article">
<meta property="og:title" content="我所敬佩的开复老师">
<meta property="og:url" content="http://www.ixirong.com/2015/06/28/the-things-i-thought-of-kaifuli/index.html">
<meta property="og:site_name" content="自由">
<meta property="og:description" content="今天早上看了优酷头条上高晓松导演的关于开复老师的记录片“筑梦者之李开复《向死而生》”，看的过程中几度落泪，同情？不，应该是共鸣，某些言语上的共鸣，开复老师在事业上面无疑是很成功的，试问当今还有谁能够达到他做的这些：28岁获得卡内基梅隆大学计算机系博学位，发表的论文被授予“最重要科学创新奖”，之后苹果副总裁、微软副总裁、google副总裁，再到09年创办创新工场，帮助年轻人实现梦想！可是，在这些光环">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="我所敬佩的开复老师">
<meta name="twitter:description" content="今天早上看了优酷头条上高晓松导演的关于开复老师的记录片“筑梦者之李开复《向死而生》”，看的过程中几度落泪，同情？不，应该是共鸣，某些言语上的共鸣，开复老师在事业上面无疑是很成功的，试问当今还有谁能够达到他做的这些：28岁获得卡内基梅隆大学计算机系博学位，发表的论文被授予“最重要科学创新奖”，之后苹果副总裁、微软副总裁、google副总裁，再到09年创办创新工场，帮助年轻人实现梦想！可是，在这些光环">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'xirong'
    }
  };
</script>

  <title> 我所敬佩的开复老师 | 自由 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">自由</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'CMcqT-2yt1yatw_zFhNC','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                我所敬佩的开复老师
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-06-28T09:52:21+08:00" content="2015-06-28">
              2015-06-28
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/成长/" itemprop="url" rel="index">
                    <span itemprop="name">成长</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2015/06/28/the-things-i-thought-of-kaifuli/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2015/06/28/the-things-i-thought-of-kaifuli/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2015/06/28/the-things-i-thought-of-kaifuli/" class="leancloud_visitors" data-flag-title="我所敬佩的开复老师">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#x65E9;&#x4E0A;&#x770B;&#x4E86;&#x4F18;&#x9177;&#x5934;&#x6761;&#x4E0A;&#x9AD8;&#x6653;&#x677E;&#x5BFC;&#x6F14;&#x7684;&#x5173;&#x4E8E;&#x5F00;&#x590D;&#x8001;&#x5E08;&#x7684;&#x8BB0;&#x5F55;&#x7247;&#x201C;&#x7B51;&#x68A6;&#x8005;&#x4E4B;&#x674E;&#x5F00;&#x590D;&#x300A;&#x5411;&#x6B7B;&#x800C;&#x751F;&#x300B;&#x201D;&#xFF0C;&#x770B;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x51E0;&#x5EA6;&#x843D;&#x6CEA;&#xFF0C;&#x540C;&#x60C5;&#xFF1F;&#x4E0D;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x5171;&#x9E23;&#xFF0C;&#x67D0;&#x4E9B;&#x8A00;&#x8BED;&#x4E0A;&#x7684;&#x5171;&#x9E23;&#xFF0C;&#x5F00;&#x590D;&#x8001;&#x5E08;&#x5728;&#x4E8B;&#x4E1A;&#x4E0A;&#x9762;&#x65E0;&#x7591;&#x662F;&#x5F88;&#x6210;&#x529F;&#x7684;&#xFF0C;&#x8BD5;&#x95EE;&#x5F53;&#x4ECA;&#x8FD8;&#x6709;&#x8C01;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x4ED6;&#x505A;&#x7684;&#x8FD9;&#x4E9B;&#xFF1A;28&#x5C81;&#x83B7;&#x5F97;&#x5361;&#x5185;&#x57FA;&#x6885;&#x9686;&#x5927;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x535A;&#x5B66;&#x4F4D;&#xFF0C;&#x53D1;&#x8868;&#x7684;&#x8BBA;&#x6587;&#x88AB;&#x6388;&#x4E88;&#x201C;&#x6700;&#x91CD;&#x8981;&#x79D1;&#x5B66;&#x521B;&#x65B0;&#x5956;&#x201D;&#xFF0C;&#x4E4B;&#x540E;&#x82F9;&#x679C;&#x526F;&#x603B;&#x88C1;&#x3001;&#x5FAE;&#x8F6F;&#x526F;&#x603B;&#x88C1;&#x3001;google&#x526F;&#x603B;&#x88C1;&#xFF0C;&#x518D;&#x5230;09&#x5E74;&#x521B;&#x529E;&#x521B;&#x65B0;&#x5DE5;&#x573A;&#xFF0C;&#x5E2E;&#x52A9;&#x5E74;&#x8F7B;&#x4EBA;&#x5B9E;&#x73B0;&#x68A6;&#x60F3;&#xFF01;&#x53EF;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x5149;&#x73AF;&#x7684;&#x80CC;&#x540E;&#xFF0C;&#x727A;&#x7272;&#x4E86;&#x5065;&#x5EB7;&#xFF0C;&#x4E0E;&#x5BB6;&#x4EBA;&#x76F8;&#x5904;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x77ED;&#x7247;&#x4E2D;&#x5F00;&#x590D;&#x8C08;&#x8D77;&#x7236;&#x4EB2;&#x51E0;&#x5EA6;&#x54FD;&#x54BD;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x7236;&#x4EB2;&#x5728;&#x4E16;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x6CA1;&#x6709;&#x6765;&#x5F97;&#x53CA;&#x966A;&#x4F34;&#x3001;&#x5C3D;&#x5B5D;&#x9053;&#xFF0C;&#x800C;&#x6BCD;&#x4EB2;&#x4E5F;&#x5E74;&#x8001;&#x5931;&#x5FC6;&#xFF0C;&#x8BB0;&#x4E0D;&#x8D77;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4ED6;&#x505A;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#xFF0C;&#x4ED6;&#x7684;&#x7236;&#x6BCD;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF1B;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x59BB;&#x5B50;&#x3001;&#x5B69;&#x5B50;&#x6765;&#x8BB2;&#xFF0C;&#x6BCF;&#x6B21;&#x804C;&#x4F4D;&#x7684;&#x53D8;&#x6362;&#xFF0C;&#x4ED6;&#x4EEC;&#x4ED8;&#x51FA;&#x7684;&#x90FD;&#x662F;&#x79BB;&#x5F00;&#x5F53;&#x524D;&#x7684;&#x751F;&#x6D3B;&#x73AF;&#x5883;&#xFF0C;&#x5F53;&#x524D;&#x719F;&#x6089;&#x7684;&#x4EBA;&#xFF0C;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x9002;&#x5E94;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4ED6;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x7247;&#x4E2D;&#x5F00;&#x590D;&#x8001;&#x5E08;&#x89C9;&#x5F97;&#x5F88;&#x5BF9;&#x4E0D;&#x8D77;&#x81EA;&#x5DF1;&#x7684;&#x59BB;&#x5B50;&#x5B69;&#x5B50;&#xFF0C;&#x51B3;&#x5B9A;&#x8981;&#x591A;&#x82B1;&#x4E9B;&#x65F6;&#x95F4;&#x966A;&#x4F34;&#x4ED6;&#x4EEC;&#x3002;&#x5728;&#x8E0F;&#x8FC7;&#x4E86;&#x9B3C;&#x95E8;&#x5173;&#x4E4B;&#x540E;&#xFF0C;&#x5F00;&#x590D;&#x8001;&#x5E08;&#x771F;&#x60C5;&#x7684;&#x547C;&#x5524;&#x201C;&#x68A6;&#x60F3;&#x4E0D;&#x518D;&#x662F;&#x4E89;&#x5206;&#x593A;&#x79D2;&#x3001;&#x6539;&#x53D8;&#x4E16;&#x754C;&#xFF0C;&#x800C;&#x662F;&#x5065;&#x5EB7;&#x3001;&#x4EB2;&#x4EBA;&#x3001;&#x7231;&#x3001;&#x4E8B;&#x4E1A;&#x5171;&#x540C;&#x7B51;&#x6210;&#x7684;&#x771F;&#x5B9E;&#x68A6;&#x60F3;&#xFF0C;&#x8DDF;&#x968F;&#x5185;&#x5FC3;&#x3001;&#x611F;&#x53D7;&#x4E16;&#x754C;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x771F;&#x5B9E;&#x6709;&#x610F;&#x4E49;&#x3001;&#x975E;&#x51E1;&#x7684;&#x4EBA;&#x751F;&#xFF01;&#x201D;</p>
<a id="more"></a>
<blockquote>
<p>&#x5728;&#x611F;&#x52A8;&#x4E0E;&#x6C89;&#x601D;&#x4E2D;&#xFF0C;&#x674E;&#x5F00;&#x590D;&#x5148;&#x751F;&#x4EAE;&#x76F8;&#xFF0C;&#x4ED6;&#x4EE5;&#x201C;&#x6211;&#x4FEE;&#x5F97;&#x7684;7&#x4E2A;&#x6B7B;&#x4EA1;&#x5B66;&#x5206;&#x201D;&#x505A;&#x4E86;&#x6F14;&#x8BB2;&#xFF0C;&#x7B2C;&#x4E00;&#x6761;&#x5C31;&#x662F;&#x5065;&#x5EB7;&#x65E0;&#x4EF7;&#xFF0C;&#x5065;&#x5EB7;&#x662F;&#x68A6;&#x60F3;&#x7684;&#x57FA;&#x77F3;&#xFF0C;&#x8981;&#x7231;&#x60DC;&#x81EA;&#x5DF1;&#x7684;&#x5065;&#x5EB7;&#xFF0C;&#x4ED6;&#x8BF4;&#x4EE5;&#x524D;&#x4E0D;&#x91CD;&#x89C6;&#x7761;&#x7720;&#x662F;&#x6700;&#x5927;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x63D0;&#x5230;&#x6BCD;&#x4EB2;&#xFF0C;&#x674E;&#x5F00;&#x590D;&#x51E0;&#x6B21;&#x54FD;&#x54BD;&#xFF0C;&#x4ED6;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x5386;&#x544A;&#x8BC9;&#x5E74;&#x8F7B;&#x7684;&#x7B51;&#x68A6;&#x8005;&#xFF0C;&#x4EBA;&#x751F;&#x4E00;&#x5B9A;&#x8981;&#x5FEB;&#x4E50;&#xFF0C;&#x91CD;&#x4EB2;&#x60C5;&#x3002;&#x674E;&#x5F00;&#x590D;&#x8868;&#x793A;&#xFF0C;&#x5982;&#x4ECA;&#x4ED6;&#x60F3;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#x4ED6;&#x5728;&#x75C5;&#x4E2D;&#x7684;&#x4F53;&#x609F;&#xFF0C;&#x201C;&#x8FD9;&#x6BB5;&#x671F;&#x95F4;&#x6211;&#x6DF1;&#x523B;&#x611F;&#x53D7;&#x5230;&#x8EAB;&#x5FC3;&#x7684;&#x75DB;&#x82E6;&#x53CA;&#x5BB6;&#x4EBA;&#x65E0;&#x5C3D;&#x7684;&#x7231;&#xFF0C;&#x8BA9;&#x6211;&#x61C2;&#x5F97;&#x5206;&#x8FA8;&#x771F;&#x6B63;&#x6709;&#x610F;&#x4E49;&#x3001;&#x503C;&#x5F97;&#x6211;&#x594B;&#x529B;&#x53BB;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x6BB5;&#x610F;&#x5916;&#x4E4B;&#x65C5;&#x8FD8;&#x8BA9;&#x6211;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x8FC7;&#x5F80;&#x7684;&#x76F2;&#x70B9;&#xFF0C;&#x6211;&#x6240;&#x8FFD;&#x6C42;&#x7684;&#x2018;&#x505A;&#x6700;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#x3001;&#x4E16;&#x754C;&#x56E0;&#x4F60;&#x4E0D;&#x540C;&#x2019;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x540D;&#x5229;&#x7684;&#x6D6E;&#x6DA8;&#x8BA9;&#x6211;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x95F4;&#x504F;&#x79BB;&#x4E86;&#x8F74;&#x5FC3;&#xFF0C;&#x4EE5;&#x81F4;&#x8FF7;&#x7729;&#x5176;&#x4E2D;&#xFF0C;&#x4ED8;&#x51FA;&#x4E86;&#x6C89;&#x91CD;&#x7684;&#x4EE3;&#x4EF7;&#x800C;&#x4E0D;&#x81EA;&#x77E5;&#x3002;&#x8FD9;&#x573A;&#x751F;&#x6B7B;&#x5927;&#x75C5;&#x5F00;&#x542F;&#x4E86;&#x6211;&#x7684;&#x667A;&#x6167;&#xFF0C;&#x6211;&#x4F9D;&#x65E7;&#x4F1A;&#x5C3D;&#x529B;&#x6295;&#x8EAB;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BA9;&#x4E16;&#x754C;&#x66F4;&#x597D;&#xFF1B;&#x4F46;&#x6211;&#x66F4;&#x771F;&#x5207;&#x5730;&#x77E5;&#x9053;&#xFF0C;&#x751F;&#x547D;&#x8BE5;&#x600E;&#x4E48;&#x8FC7;&#x624D;&#x662F;&#x6700;&#x5706;&#x6EE1;&#x7684;&#x3002;&#x201D;&#x674E;&#x5F00;&#x590D;&#x8BF4;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8FD8;&#x80FD;&#x6D3B;&#x591A;&#x4E45;&#xFF0C;&#x4F46;&#x7948;&#x6C42;&#x5728;&#x4F59;&#x751F;&#x91CC;&#x8131;&#x6389;&#x4E00;&#x751F;&#x7684;&#x865A;&#x8363;&#x548C;&#x6210;&#x5C31;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x8840;&#x6709;&#x8089;&#x7684;&#x4EBA;&#xFF0C;&#x5C3D;&#x5FC3;&#x53BB;&#x505A;&#x4E00;&#x4E2A;&#x7B51;&#x68A6;&#x8005;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x6709;&#x5927;&#x7231;&#x7684;&#x674E;&#x5F00;&#x590D;&#x3002; &#x2014;-<strong>2015-06-28 &#x300A;&#x5411;&#x6B7B;&#x800C;&#x751F;&#x300B;&#x5317;&#x4EAC;&#x9996;&#x6620;&#x793C;&#x5F00;&#x590D;&#x8001;&#x5E08;&#x53D1;&#x8A00;</strong></p>
</blockquote>
<p>&#x201C;&#x9664;&#x53BB;&#x865A;&#x540D;&#x548C;&#x6210;&#x5C31;&#xFF0C;&#x4F60;&#x7684;&#x4EBA;&#x751F;&#x8FD8;&#x5269;&#x4E0B;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x201C;&#x5584;&#x68A6;&#x8005;&#x4EAB;&#x975E;&#x51E1;&#x201D; </p>
<p>&#x56FD;&#x5185;&#x76EE;&#x524D;&#x89C6;&#x9891;&#x7F51;&#x7AD9;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x770B;&#x7684;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x817E;&#x8BAF;&#x89C6;&#x9891;&#x7684;&#x5409;&#x514B;&#x96BD;&#x9038;&#x7684;&#x6B4C;&#x66F2;&#x6216;&#x8005; YouTube&#x4E0A;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x6587;&#x7AE0;&#x6700;&#x540E;&#x7ED9;&#x51FA;&#xFF08;&#x9700;&#x7FFB;&#x5899;&#x54E6;&#xFF0C;&#x4E0D;&#x4F1A;&#x7684;&#x5728;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x4E2D;&#x641C;&#x7D22;shadowsocks&#xFF09;</p>
<iframe class="iframe-video" src="http://v.qq.com/iframe/player.html?vid=u0016bsn3m7&amp;tiny=0&amp;auto=0" allowfullscreen></iframe>

<p>&#x6587;&#x7AE0;&#x7684;&#x9898;&#x76EE;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x656C;&#x4F69;&#xFF1F;&#x5F53;&#x6211;&#x521A;&#x521A;&#x4E0A;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x8001;&#x5E08;&#x5B59;&#x51CC;&#x4E91;&#x8001;&#x5E08;&#x90AE;&#x4EF6;&#x7ED9;&#x6211;&#xFF0C;&#x8BA9;&#x6211;&#x5173;&#x6CE8;&#x5F00;&#x590D;&#x8001;&#x5E08;<a href="http://blog.sina.com.cn/s/articlelist_1197161814_1_1.html" target="_blank" rel="external">&#x300A;&#x7ED9;&#x5E74;&#x8F7B;&#x4EBA;&#x7684;&#x4E03;&#x5C01;&#x4FE1;&#x300B;</a>&#xFF0C;&#x4ECE;&#x90A3;&#x65F6;&#x8D77;&#x77E5;&#x9053;&#x4E86;&#x5F00;&#x590D;&#x8FD9;&#x4E2A;&#x4EBA;&#xFF0C;&#x5E76;&#x6162;&#x6162;&#x770B;&#x4ED6;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x6587;&#x7AE0;&#x3001;&#x4E66;&#x7C4D;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x8BA4;&#x540C;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x89C2;&#x70B9;&#xFF0C;&#x6162;&#x6162;&#x5FC3;&#x58F0;&#x656C;&#x4F69;&#xFF0C;&#x8F6C;&#x773C;&#x6BD5;&#x4E1A;&#x5DF2;&#x7ECF;&#x4E09;&#x5E74;&#x4E86;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x597D;&#x4E45;&#x6CA1;&#x6709;&#x518D;&#x770B;&#x5F00;&#x590D;&#x8001;&#x5E08;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8D81;&#x6B21;&#x673A;&#x4F1A;&#x4E5F;&#x6574;&#x7406;&#x4E0B;&#x3002;</p>
<ul>
<li>&#x5F00;&#x590D;&#x8001;&#x5E08;&#x5199;&#x7684;&#x4E66; <a href="http://book.douban.com/search/%E6%9D%8E%E5%BC%80%E5%A4%8D" target="_blank" rel="external">http://book.douban.com/search/%E6%9D%8E%E5%BC%80%E5%A4%8D</a></li>
<li><a href="http://blog.sina.com.cn/s/articlelist_1197161814_1_1.html" target="_blank" rel="external">&#x7ED9;&#x4E2D;&#x56FD;&#x9752;&#x5E74;&#x7684;&#x4E03;&#x5C01;&#x4FE1;</a></li>
<li><a href="http://www.kaifulee.com/" target="_blank" rel="external">&#x5F00;&#x590D;&#x5B66;&#x751F;&#x7F51;</a> &#x5927;&#x5B66;&#x90A3;&#x4F1A;&#x8FD8;&#x7ECF;&#x5E38;&#x770B;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x8C8C;&#x4F3C;&#x4E0A;&#x4E0D;&#x53BB;&#x4E86;&#x3002;</li>
<li><a href="http://blog.sina.com.cn/kaifulee" target="_blank" rel="external">&#x5F00;&#x590D;&#x8001;&#x5E08;&#x65B0;&#x6D6A;&#x535A;&#x5BA2;</a></li>
<li><a href="http://weibo.com/kaifulee" target="_blank" rel="external">&#x5F00;&#x590D;&#x8001;&#x5E08;&#x5FAE;&#x535A;</a> &#x4ECD;&#x7ECF;&#x5E38;&#x66F4;&#x65B0;</li>
<li><a href="http://www.zhihu.com/people/kaifulee" target="_blank" rel="external">&#x5F00;&#x590D;&#x8001;&#x5E08;&#x77E5;&#x4E4E;&#x8BBA;&#x575B;</a></li>
<li>&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x627E;&#x4E0D;&#x5230;&#x4E86;~</li>
</ul>
<p>&#x540E;&#x5E8F;&#xFF1A;</p>
<p>&#x5728;&#x300A;&#x5411;&#x6B7B;&#x800C;&#x751F;&#x300B;&#x5317;&#x4EAC;&#x9996;&#x6620;&#x793C;&#x4E0A;&#x9762;&#xFF0C;&#x4E3A;&#x4E86;&#x547C;&#x5401;&#x66F4;&#x591A;&#x4EBA;&#x5173;&#x6CE8;&#x4F01;&#x4E1A;&#x5BB6;&#x5065;&#x5EB7;&#xFF0C;&#x547C;&#x5401;&#x4F01;&#x4E1A;&#x5BB6;&#x5173;&#x6CE8;&#x81EA;&#x5DF1;&#x7684;&#x7761;&#x7720;&#xFF0C;&#x4E2D;&#x56FD;&#x4F01;&#x4E1A;&#x5BB6;&#x6742;&#x5FD7;&#x3001;&#x5357;&#x90FD;&#x5468;&#x520A;&#x548C;&#x6155;&#x601D;&#x5BDD;&#x5177;&#x5171;&#x540C;&#x53D1;&#x8D77;&#x4E86;&#x201C;&#x4F01;&#x4E1A;&#x5BB6;&#x5065;&#x5EB7;&#x7761;&#x7720;&#x5173;&#x7231;&#x65E5;&#x201D;&#x7684;&#x516C;&#x76CA;&#x6D3B;&#x52A8;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x5C06;&#x6BCF;&#x5E74;&#x7684;6&#x6708;27&#x65E5;&#x5B9A;&#x4E3A;&#x201C;&#x4F01;&#x4E1A;&#x5BB6;&#x5065;&#x5EB7;&#x7761;&#x7720;&#x5173;&#x7231;&#x65E5;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x5E74;&#x8F7B;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x5F53;&#x4F60;&#x611F;&#x89C9;&#x6CA1;&#x4E8B;&#x60C5;&#x505A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7761;&#x89C9;&#x5427;&#xFF01;</p>
<p>&#x5F00;&#x590D;&#x8001;&#x5E08;&#x5728;&#x5317;&#x4EAC;&#x9996;&#x6620;&#x793C;&#x4E0A;&#x9762;&#x7684;&#x6F14;&#x8BB2;&#x5168;&#x6587;&#xFF1A;<a href="http://www.cyzone.cn/a/20150627/276686.html" target="_blank" rel="external">http://www.cyzone.cn/a/20150627/276686.html</a></p>
<p>&#x4E00;&#x8D77;&#x6B23;&#x8D4F;&#x5F00;&#x590D;&#x8001;&#x5E08;&#x5B8C;&#x6574;&#x7684;&#x91C7;&#x8BBF;&#xFF08;YouTube&#x2014;&#x7FFB;&#x5899;&#xFF09;&#xFF1A;</p>
<iframe class="iframe-video" src="https://www.youtube.com/embed/ktd0xmz8kDk" frameborder="0" allowfullscreen></iframe>
      
    </div>

    <div>
      
        
<div id="wechat_subscriber" style="display: block； padding: 10px 0; margin: 20px auto; width: 100%; text-align: center">
    <img id="wechat_subscriber_qcode" src="/images/GeekNotes.jpg" alt="xirong wechat" style="width: 200px; max-width: 100%;"/>
    <div>我在公众号与你分享更多内容</div>
</div>

      
    </div>

    <div>
      
        
  <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
    <div>坚持原创技术分享，您的支持将鼓励我继续创作！</div>
    <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
      <span>赏</span>
    </button>
    <div id="QR" style="display: none;">
      
        <div id="wechat" style="display: inline-block">
          <img id="wechat_qr" src="/images/wechat.png" alt="xirong WeChat Pay"/>
          <p>微信打赏</p>
        </div>
      
      
        <div id="alipay" style="display: inline-block">
          <img id="alipay_qr" src="/images/alipay.png" alt="xirong Alipay"/>
          <p>支付宝打赏</p>
        </div>
      
    </div>
  </div>


      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/大学生/" rel="tag">#大学生</a>
          
            <a href="/tags/成长/" rel="tag">#成长</a>
          
            <a href="/tags/青年/" rel="tag">#青年</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/06/24/how-hbase-use-apache-phoenix/" rel="next" title="使用Phoenix通过sql语句更新操作hbase数据">
                <i class="fa fa-chevron-left"></i> 使用Phoenix通过sql语句更新操作hbase数据
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/07/10/presentation-about-sealog-system/" rel="prev" title="分布式实时日志系统（五）系统整体架构介绍">
                分布式实时日志系统（五）系统整体架构介绍 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2015/06/28/the-things-i-thought-of-kaifuli/"
           data-title="我所敬佩的开复老师" data-url="http://www.ixirong.com/2015/06/28/the-things-i-thought-of-kaifuli/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/xirong.jpg"
               alt="xirong" />
          <p class="site-author-name" itemprop="name">xirong</p>
          <p class="site-description motion-element" itemprop="description">思考生活，分享故事</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">62</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">20</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">93</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="http://weixin.sogou.com/weixin?type=1&query=Geek_Notes&ie=utf8&w=01019900&sut=4856&sst0=1451527213494&lkt=1%2C1451527211738%2C1451527211738" target="_blank" title="wechat">
                  
                    <i class="fa fa-fw fa-weixin"></i>
                  
                  wechat
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/jackieliuxirong" target="_blank" title="weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/xirong/" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              推荐阅读
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.zhoujingen.cn/blog/" title="敏捷个人" target="_blank">敏捷个人</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.ruanyifeng.com/blog/" title="阮一峰" target="_blank">阮一峰</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://coolshell.cn/" title="酷壳" target="_blank">酷壳</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.read.org.cn/" title="战隼" target="_blank">战隼</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.mifengtd.cn/" title="褪墨" target="_blank">褪墨</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://mindhacks.cn/" title="刘未鹏" target="_blank">刘未鹏</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://ddimples.github.io/" title="程小黑" target="_blank">程小黑</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.javachen.com/" title="JavaChen" target="_blank">JavaChen</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2014 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xirong</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="powered-by">
  <div style="float:left;margin-top:7px;margin-right:10px;">
  <script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1254711542'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s11.cnzz.com/z_stat.php%3Fid%3D1254711542%26show%3Dpic' type='text/javascript'%3E%3C/script%3E"));</script>
  </div>
   鲁ICP备15013969号
</div>

<div class="theme-info">
  Clone theme -
  <a class="theme-link" href="https://github.com/xirong/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xirong"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("HfEUHBkxIxPKFFWsM8E29K81-gzGzoHsz", "j8gTHCF5cxmeGRbV0QIujeUw");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script>


</body>
</html>
