<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />









  <meta name="360-site-verification" content="2ebfa6bfe0988ac65c00405e3012ab01" />




  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="mac数据安全,mac下备份数据,time machine使用方法,time machine使用技巧,pc 数据备份" />





  <link rel="alternate" href="/atom.xml" title="自由" type="application/atom+xml" />









<meta name="description" content="事情如果有变坏的可能，不管这种可能性多么小，它总会发生（Anything that can go wrong will go wrong）。  - 墨菲定律（Murphy’s law)

在此之前你有想过备份数据的事情吗？ 无论有或者没有，从此刻起，你都应该好好思考怎么去保护自己数据的可用性、安全性，以避免数据丢失、数据泄露所带来的时间经济等各种损失。我想能看到这篇文章的你，对 mac 或者 pc">
<meta property="og:type" content="article">
<meta property="og:title" content="Mac下数据备份策略">
<meta property="og:url" content="http://www.ixirong.com/2015/12/12/how-to-backup-files/index.html">
<meta property="og:site_name" content="自由">
<meta property="og:description" content="事情如果有变坏的可能，不管这种可能性多么小，它总会发生（Anything that can go wrong will go wrong）。  - 墨菲定律（Murphy’s law)

在此之前你有想过备份数据的事情吗？ 无论有或者没有，从此刻起，你都应该好好思考怎么去保护自己数据的可用性、安全性，以避免数据丢失、数据泄露所带来的时间经济等各种损失。我想能看到这篇文章的你，对 mac 或者 pc">
<meta property="og:image" content="http://static.ixirong.com/pic/mac/backup-files.jpg">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Mac下数据备份策略">
<meta name="twitter:description" content="事情如果有变坏的可能，不管这种可能性多么小，它总会发生（Anything that can go wrong will go wrong）。  - 墨菲定律（Murphy’s law)

在此之前你有想过备份数据的事情吗？ 无论有或者没有，从此刻起，你都应该好好思考怎么去保护自己数据的可用性、安全性，以避免数据丢失、数据泄露所带来的时间经济等各种损失。我想能看到这篇文章的你，对 mac 或者 pc">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'xirong'
    }
  };
</script>

  <title> Mac下数据备份策略 | 自由 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">自由</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'CMcqT-2yt1yatw_zFhNC','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Mac下数据备份策略
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-12-12T23:30:13+08:00" content="2015-12-12">
              2015-12-12
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/mac/" itemprop="url" rel="index">
                    <span itemprop="name">mac</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2015/12/12/how-to-backup-files/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2015/12/12/how-to-backup-files/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2015/12/12/how-to-backup-files/" class="leancloud_visitors" data-flag-title="Mac下数据备份策略">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="http://static.ixirong.com/pic/mac/backup-files.jpg" alt="backup-file"></p>
<blockquote>
<p>&#x4E8B;&#x60C5;&#x5982;&#x679C;&#x6709;&#x53D8;&#x574F;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x4E0D;&#x7BA1;&#x8FD9;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x591A;&#x4E48;&#x5C0F;&#xFF0C;&#x5B83;&#x603B;&#x4F1A;&#x53D1;&#x751F;&#xFF08;Anything that can go wrong will go wrong&#xFF09;&#x3002;  - &#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#xFF08;Murphy&#x2019;s law)</p>
</blockquote>
<p>&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x4F60;&#x6709;&#x60F3;&#x8FC7;&#x5907;&#x4EFD;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x60C5;&#x5417;&#xFF1F; &#x65E0;&#x8BBA;&#x6709;&#x6216;&#x8005;&#x6CA1;&#x6709;&#xFF0C;&#x4ECE;&#x6B64;&#x523B;&#x8D77;&#xFF0C;&#x4F60;&#x90FD;&#x5E94;&#x8BE5;&#x597D;&#x597D;&#x601D;&#x8003;&#x600E;&#x4E48;&#x53BB;&#x4FDD;&#x62A4;&#x81EA;&#x5DF1;&#x6570;&#x636E;&#x7684;&#x53EF;&#x7528;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x6570;&#x636E;&#x4E22;&#x5931;&#x3001;&#x6570;&#x636E;&#x6CC4;&#x9732;&#x6240;&#x5E26;&#x6765;&#x7684;&#x65F6;&#x95F4;&#x7ECF;&#x6D4E;&#x7B49;&#x5404;&#x79CD;&#x635F;&#x5931;&#x3002;&#x6211;&#x60F3;&#x80FD;&#x770B;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x4F60;&#xFF0C;&#x5BF9; mac &#x6216;&#x8005; pc &#x7684;&#x4F7F;&#x7528;&#x4E0A;&#x57FA;&#x672C;&#x4E0D;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x4ECE;&#x4E8B;&#x4EC0;&#x4E48;&#x804C;&#x4E1A;&#xFF0C;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E2D;&#x5C11;&#x4E0D;&#x4E86;&#x4E0E;&#x7535;&#x8111;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x7136;&#x7684;&#x4F60;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x5199;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5B89;&#x88C5;&#x7684;&#x5404;&#x79CD;&#x8F6F;&#x4EF6;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5904;&#x7406;&#x7684; word &#x6587;&#x6863;&#x3001;excel &#x8868;&#x683C;&#x3001;ppt &#x6F14;&#x8BB2;&#x7A3F;&#x7B49;&#x7B49;&#xFF0C;&#x4F7F;&#x7528;&#x7535;&#x8111;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x6570;&#x636E;&#x5C31;&#x8D8A;&#x591A;&#xFF0C;&#x4EA7;&#x751F;&#x7684;&#x4EF7;&#x503C;&#x4E5F;&#x5C31;&#x8D8A;&#x5927;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x968F;&#x7740;&#x4F60;&#x7684;&#x8EAB;&#x4EFD;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x5F71;&#x54CD;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x3002;&#x4EE5;&#x524D;&#x6211;&#x4E00;&#x76F4;&#x4FA5;&#x5E78;&#x7684;&#x8BA4;&#x4E3A;&#xFF0C;&#x5728;&#x6211;&#x8EAB;&#x4E0A;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6570;&#x636E;&#x4E22;&#x5931;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x50CF;&#x786C;&#x76D8;&#x635F;&#x574F;&#x8FD9;&#x79CD;&#x6982;&#x7387;&#x6781;&#x4F4E;&#x7684;&#x4E8B;&#x4EF6;&#x66F4;&#x4E0D;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#xFF0C;&#x53EF;&#x4E07;&#x4E07;&#x6CA1;&#x60F3;&#x5230;&#xFF0C;&#x4E0A;&#x5468;&#x5347;&#x7EA7;&#x4E86;mac &#x4E0A;&#x7684; iTunes &#xFF0C;&#x5347;&#x7EA7;&#x8FC7;&#x7A0B;&#x4E2D;&#x91CD;&#x542F;&#x5BFC;&#x81F4;&#x518D;&#x4E5F;&#x65E0;&#x6CD5;&#x5F00;&#x673A;&#xFF0C;&#x5C1D;&#x8BD5;&#x5404;&#x79CD;&#x529E;&#x6CD5;&#x65E0;&#x679C;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x53BB;&#x7684;&#x82F9;&#x679C;&#x96F6;&#x552E;&#x5E97;&#x7EF4;&#x4FEE;&#xFF0C;&#x4E07;&#x5E78;&#x7684;&#x662F;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x4E22;&#x5931;&#x3002;&#x7531;&#x4E8E;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x600E;&#x4E48;&#x5173;&#x6CE8;&#xFF0C;&#x8BB8;&#x591A;&#x6700;&#x8FD1;&#x7684;&#x6570;&#x636E;&#x90FD;&#x6CA1;&#x6709;&#x5907;&#x4EFD;&#xFF0C;&#x7EF4;&#x4FEE;&#x5DE5;&#x7A0B;&#x5E08;&#x4E00;&#x76F4;&#x5F3A;&#x8C03;&#x6570;&#x636E;&#x5F88;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#xFF0C;&#x5373;&#x4F7F;&#x627E;&#x4E13;&#x4E1A;&#x7684;&#x6062;&#x590D;&#x56E2;&#x961F;&#xFF0C;&#x82B1;&#x8D39;&#x4E00;&#x7B14;&#x4E0D;&#x5C0F;&#x7684;&#x8D39;&#x7528;&#x4E0D;&#x8BF4;&#xFF0C;&#x8FD8;&#x4E0D;&#x5B9A;&#x80FD;&#x5168;&#x90E8;&#x627E;&#x56DE;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x6EF4;&#x4E2A;&#x5C0F;&#x5FC3;&#x810F;&#x554A;&#x2026;&#x2026;<br><a id="more"></a><br>&#x81EA;&#x6B64;&#x4EE5;&#x540E;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x5907;&#x4EFD;&#x7684;&#x4E8B;&#x60C5;&#x91CD;&#x89C6;&#x8D77;&#x6765;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x5728;mac osx&#x7CFB;&#x7EDF;&#x4E0A;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x5957;&#x5B89;&#x5168;&#x53EF;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x91CC;&#x5199;&#x51FA;&#x6765;&#x4F9B;&#x5927;&#x5BB6;&#x53C2;&#x8003;&#x3002;</p>
<p><strong>&#x6574;&#x4F53;&#x7684;&#x539F;&#x5219;&#x662F;&#x5173;&#x7CFB;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5B89;&#x88C5;&#x7684;&#x8F6F;&#x4EF6;&#x3001;bash/git/vim/zsh&#x7B49;&#x5404;&#x79CD;&#x914D;&#x7F6E;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x6587;&#x6863;&#xFF0C;&#x7EDF;&#x7EDF;&#x4EA4;&#x7ED9; mac &#x4E0A;&#x7684;&#x597D;&#x52A9;&#x624B; &#x201C;time machine&#x201D;&#xFF0C;&#x5E76;&#x4E14;&#x9009;&#x62E9;&#x52A0;&#x5BC6;&#x5907;&#x4EFD;&#x7684;&#x65B9;&#x5F0F;&#xFF1B;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5BF9;&#x91CD;&#x8981;&#x6570;&#x636E;&#x505A;&#x5230;&#x5197;&#x4F59;&#x5907;&#x4EFD;&#xFF08;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x6709;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;copy&#xFF09;&#xFF0C;&#x5B58;&#x50A8;&#x5230;&#x4E91;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x56FD;&#x5916;&#x7684;icloud&#x3001;drop box&#x3001;google drive&#xFF0C;&#x56FD;&#x5185;&#x7684;&#x767E;&#x5EA6;&#x4E91;&#x3001;&#x817E;&#x8BAF;&#x5FAE;&#x4E91;&#x3001;&#x91D1;&#x5C71;&#x5FEB;&#x76D8;&#x7B49;&#x3002;</strong></p>
<p>Time machine &#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A; osx &#x597D;&#x7528;&#x4E8E; windows &#x7684;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;time machine&#x5907;&#x4EFD;&#x4E86;&#x81EA;&#x5DF1;&#x7684;mac&#xFF0C;&#x5373;&#x4F7F;&#x786C;&#x76D8;&#x574F;&#x6389;&#x3001;&#x4E0D;&#x5E78;&#x88AB;&#x76D7;&#x53C8;&#x6216;&#x8005;&#x4E0D;&#x4E3A;&#x4EBA;&#x6240;&#x6297;&#x62D2;&#x7684;&#x56E0;&#x7D20;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x91CD;&#x542F;&#x673A;&#x5668;&#xFF0C;&#x9009;&#x62E9;&#x4ECE; time machine&#x4E2D;&#x5907;&#x4EFD;&#xFF0C;&#x5373;&#x53EF;&#x6062;&#x590D;&#x5230;&#x4F60;&#x4E4B;&#x524D;&#x7684;&#x5DE5;&#x4F5C;&#x72B6;&#x6001;&#xFF0C;&#x5305;&#x62EC;&#x6240;&#x6709;&#x7684;&#x673A;&#x5668;&#x8BBE;&#x7F6E;&#x3001;&#x5F00;&#x673A;&#x9879;&#x3001;&#x6D4F;&#x89C8;&#x7684;&#x6807;&#x7B7E;&#x9875;&#x3001;&#x5904;&#x7406;&#x7684;&#x6587;&#x6863;&#x3001;&#x770B;&#x7684;&#x7F8E;&#x5267;&#x8FDB;&#x5EA6;&#x7EDF;&#x7EDF;&#x8DDF;&#x4E4B;&#x524D;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4EAB;&#x53D7;&#x8FD9;&#x4E48;&#x65B9;&#x4FBF;&#x5FEB;&#x6377;&#x7684;&#x670D;&#x52A1;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x4EE4;&#x4EBA;&#x611F;&#x52A8;&#x7684;&#xFF1B;time machine&#x8FD8;&#x53EF;&#x4EE5;&#x8BA9;&#x6587;&#x6863;&#x6709;&#x4E86;&#x5386;&#x53F2;&#x7248;&#x672C;&#xFF0C;&#x5C31;&#x50CF;&#x5927;&#x5B66;&#x7684;&#x8BBA;&#x6587;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6F14;&#x7ECE;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x56DE;&#x5230;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5185;&#x5BB9;&#x7684;&#x4E22;&#x5931;&#x3002;</p>
<p>time machine&#x652F;&#x6301;&#x7684;&#x53EF;&#x9009;&#x62E9;&#x529F;&#x80FD;&#x5F88;&#x591A;&#xFF0C;&#x5907;&#x4EFD;&#x786C;&#x76D8;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#x6216;&#x8005;&#x4E0D;&#x60F3;&#x5907;&#x4EFD;&#x67D0;&#x4E9B;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6392;&#x67E5;&#x6587;&#x4EF6;/&#x6587;&#x4EF6;&#x5939;&#xFF1B;&#x5907;&#x4EFD;&#x7684;&#x786C;&#x76D8;&#x5BB9;&#x91CF;1T&#x591A;&#xFF0C;&#x603B;&#x4E0D;&#x80FD;&#x5168;&#x90E8;&#x7528;&#x6765;&#x5907;&#x4EFD;&#x5427;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5C06;&#x5907;&#x4EFD;&#x76D8;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x5206;&#x533A;&#x5B8C;&#x540E;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x6765;&#x5907;&#x4EFD;&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x6B63;&#x5E38;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x6587;&#x4EF6;&#x5C31;&#x597D;&#x4E86;&#xFF1B;&#x5907;&#x4EFD;&#x7684;&#x8D44;&#x6599;&#x88AB;&#x4EBA;&#x62FF;&#x5230;&#x540E;&#x4E0D;&#x662F;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E86;&#x4E48;&#xFF0C;&#x9009;&#x62E9;&#x52A0;&#x5BC6;&#x5907;&#x4EFD;&#x5373;&#x53EF;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;time machine &#x4E3B;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x8FD8;&#x662F;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x548C;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x7684;&#x4FDD;&#x5168;&#xFF0C;&#x4E3A;&#x4E86;&#x5B89;&#x5168;&#x8FD8;&#x9700;&#x8981;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x5176;&#x4ED6;&#x7684;&#x5907;&#x4EFD;&#x548C;&#x4FDD;&#x5168;&#x624B;&#x6BB5;&#x4EE5;&#x53CA;&#x517B;&#x6210;&#x6587;&#x6863;&#x96C6;&#x4E2D;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x8FD8;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x7F51;&#x76D8;&#x6765;&#x5197;&#x4F59;&#x5907;&#x4EFD;&#x81EA;&#x5DF1;&#x7684;&#x91CD;&#x8981;&#x6587;&#x6863;&#x3002;&#x56FD;&#x5916;&#x7684;dropbox&#x3001;google drive&#xFF0C;&#x4EE5;&#x53CA;&#x56FD;&#x5185;&#x7684;&#x767E;&#x5EA6;&#x4E91;&#x3001;&#x817E;&#x8BAF;&#x5FAE;&#x4E91;&#x3001;&#x91D1;&#x5C71;&#x5FEB;&#x76D8;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E5F;&#x6709;&#x4E0D;&#x540C;&#x70B9;&#xFF1A;&#x56FD;&#x5916;&#x7684;&#x7F51;&#x76D8;&#x5BF9;&#x5B89;&#x5168;&#x6027;&#x3001;&#x4E2A;&#x4EBA;&#x6570;&#x636E;&#x9690;&#x79C1;&#x4E0A;&#x505A;&#x7684;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6BD4;&#x56FD;&#x5185;&#x7684;&#x8981;&#x597D;&#x4E00;&#x4E9B;&#xFF0C;&#x81F3;&#x5C11;&#x4E0D;&#x4F1A;&#x68C0;&#x6D4B;&#x4F60;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4ECE;&#x800C;&#x6709;&#x9009;&#x62E9;&#x7684;&#x5C4F;&#x853D;&#xFF0C;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x9700;&#x8981;&#x7FFB;&#x5899;&#xFF0C;&#x5BF9;&#x666E;&#x901A;&#x7528;&#x6237;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4F7F;&#x7528;&#x6210;&#x672C;&#xFF1B;&#x56FD;&#x5185;&#x7684;&#x51E0;&#x5927;&#x7F51;&#x76D8;&#x5BB9;&#x91CF;&#x8D85;&#x5927;&#xFF0C;&#x5168;&#x7EC8;&#x7AEF;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x96F6;&#x6210;&#x672C;&#xFF0C;&#x540C;&#x6B65;&#x901F;&#x5EA6;&#x4E5F;&#x8F83;&#x5FEB;&#xFF0C;&#x7F3A;&#x70B9;&#x662F;&#x6BD5;&#x7ADF;&#x53D7;&#x653F;&#x6CBB;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E2A;&#x4EBA;&#x6570;&#x636E;&#x7684;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#x4E0A;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x5DEE;&#x8DDD;&#x7684;&#x3002;&#x65E0;&#x8BBA;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#xFF0C;&#x6700;&#x603B;&#x8981;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x7F51;&#x76D8;&#x7684;&#x521D;&#x8877;&#xFF0C;&#x5197;&#x4F59;&#x5907;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x591A;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x5B89;&#x5168;&#x3002;&#xFF08;&#x901A;&#x8FC7;&#x4E91;&#x76D8;&#x540C;&#x6B65;&#x8D44;&#x6599;&#x7684;&#x65B9;&#x5F0F;&#x5728;windows&#x4E0A;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#xFF0C;win&#x4E0A;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6B64;&#x65B9;&#x5F0F;&#x6765;&#x5907;&#x4EFD;&#x91CD;&#x8981;&#x7684;&#x8D44;&#x6599;&#xFF09;</p>
<p>&#x563F;&#xFF0C;&#x5C4F;&#x5E55;&#x524D;&#x7684;&#x4F60;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x5907;&#x4EFD;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x6216;&#x8005;&#x5EFA;&#x8BAE;&#xFF0C;&#x6B22;&#x8FCE;&#x7ED9;&#x6211;&#x7559;&#x8A00;&#xFF0C;&#x9001;&#x4F60;&#x5173;&#x4E8E;time machine &#x7684;&#x4F7F;&#x7528;&#x6280;&#x5DE7;&#x3002;</p>

      
    </div>

    <div>
      
        
<div id="wechat_subscriber" style="display: block； padding: 10px 0; margin: 20px auto; width: 100%; text-align: center">
    <img id="wechat_subscriber_qcode" src="/images/GeekNotes.jpg" alt="xirong wechat" style="width: 200px; max-width: 100%;"/>
    <div>我在公众号与你分享更多内容</div>
</div>

      
    </div>

    <div>
      
        
  <div style="padding: 10px 0; margin: 20px auto; width: 90%; text-align: center;">
    <div>坚持原创技术分享，您的支持将鼓励我继续创作！</div>
    <button id="rewardButton" disable="enable" onclick="var qr = document.getElementById('QR'); if (qr.style.display === 'none') {qr.style.display='block';} else {qr.style.display='none'}">
      <span>赏</span>
    </button>
    <div id="QR" style="display: none;">
      
        <div id="wechat" style="display: inline-block">
          <img id="wechat_qr" src="/images/wechat.png" alt="xirong WeChat Pay"/>
          <p>微信打赏</p>
        </div>
      
      
        <div id="alipay" style="display: inline-block">
          <img id="alipay_qr" src="/images/alipay.png" alt="xirong Alipay"/>
          <p>支付宝打赏</p>
        </div>
      
    </div>
  </div>


      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/mac/" rel="tag">#mac</a>
          
            <a href="/tags/备份/" rel="tag">#备份</a>
          
            <a href="/tags/安全/" rel="tag">#安全</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/10/06/thoughts-of-lastest-life/" rel="next" title="最近的生活">
                <i class="fa fa-chevron-left"></i> 最近的生活
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/12/13/how-to-use-time-machine/" rel="prev" title="关于time machine不可不知的技巧">
                关于time machine不可不知的技巧 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2015/12/12/how-to-backup-files/"
           data-title="Mac下数据备份策略" data-url="http://www.ixirong.com/2015/12/12/how-to-backup-files/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/xirong.jpg"
               alt="xirong" />
          <p class="site-author-name" itemprop="name">xirong</p>
          <p class="site-description motion-element" itemprop="description">思考生活，分享故事</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">62</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">20</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">93</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="http://weixin.sogou.com/weixin?type=1&query=Geek_Notes&ie=utf8&w=01019900&sut=4856&sst0=1451527213494&lkt=1%2C1451527211738%2C1451527211738" target="_blank" title="wechat">
                  
                    <i class="fa fa-fw fa-weixin"></i>
                  
                  wechat
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/jackieliuxirong" target="_blank" title="weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/xirong/" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              推荐阅读
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.zhoujingen.cn/blog/" title="敏捷个人" target="_blank">敏捷个人</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.ruanyifeng.com/blog/" title="阮一峰" target="_blank">阮一峰</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://coolshell.cn/" title="酷壳" target="_blank">酷壳</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.read.org.cn/" title="战隼" target="_blank">战隼</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.mifengtd.cn/" title="褪墨" target="_blank">褪墨</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://mindhacks.cn/" title="刘未鹏" target="_blank">刘未鹏</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://ddimples.github.io/" title="程小黑" target="_blank">程小黑</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.javachen.com/" title="JavaChen" target="_blank">JavaChen</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2014 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xirong</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="powered-by">
  <div style="float:left;margin-top:7px;margin-right:10px;">
  <script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1254711542'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s11.cnzz.com/z_stat.php%3Fid%3D1254711542%26show%3Dpic' type='text/javascript'%3E%3C/script%3E"));</script>
  </div>
   鲁ICP备15013969号
</div>

<div class="theme-info">
  Clone theme -
  <a class="theme-link" href="https://github.com/xirong/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xirong"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("HfEUHBkxIxPKFFWsM8E29K81-gzGzoHsz", "j8gTHCF5cxmeGRbV0QIujeUw");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script>


</body>
</html>
