<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />









  <meta name="360-site-verification" content="2ebfa6bfe0988ac65c00405e3012ab01" />




  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />






  <link rel="alternate" href="/atom.xml" title="自由" type="application/atom+xml" />









<meta name="description" content="&amp;#x7EB8;&amp;#x4E0A;&amp;#x5F97;&amp;#x6765;&amp;#x7EC8;&amp;#x89C9;&amp;#x6D45;&amp;#xFF0C;&amp;#x7EDD;&amp;#x77E5;&amp;#x6B64;&amp;#x4E8B;&amp;#x8981;&amp;#x8EAC;&amp;#x884C;&amp;#x3002; &amp;#x300A;&amp;#x51AC;&amp;#x591C;&amp;#x8BFB;&amp;#x4E66;&amp;#x793A;&amp;#x5B50;&amp;#x807F;&amp;#x300B">
<meta property="og:type" content="website">
<meta property="og:title" content="自由">
<meta property="og:url" content="http://www.ixirong.com/about/index.html">
<meta property="og:site_name" content="自由">
<meta property="og:description" content="&amp;#x7EB8;&amp;#x4E0A;&amp;#x5F97;&amp;#x6765;&amp;#x7EC8;&amp;#x89C9;&amp;#x6D45;&amp;#xFF0C;&amp;#x7EDD;&amp;#x77E5;&amp;#x6B64;&amp;#x4E8B;&amp;#x8981;&amp;#x8EAC;&amp;#x884C;&amp;#x3002; &amp;#x300A;&amp;#x51AC;&amp;#x591C;&amp;#x8BFB;&amp;#x4E66;&amp;#x793A;&amp;#x5B50;&amp;#x807F;&amp;#x300B">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="自由">
<meta name="twitter:description" content="&amp;#x7EB8;&amp;#x4E0A;&amp;#x5F97;&amp;#x6765;&amp;#x7EC8;&amp;#x89C9;&amp;#x6D45;&amp;#xFF0C;&amp;#x7EDD;&amp;#x77E5;&amp;#x6B64;&amp;#x4E8B;&amp;#x8981;&amp;#x8EAC;&amp;#x884C;&amp;#x3002; &amp;#x300A;&amp;#x51AC;&amp;#x591C;&amp;#x8BFB;&amp;#x4E66;&amp;#x793A;&amp;#x5B50;&amp;#x807F;&amp;#x300B">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'xirong'
    }
  };
</script>

  <title>
  

  
     | 自由
  
</title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left  ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">自由</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'CMcqT-2yt1yatw_zFhNC','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    
    
      <blockquote class="blockquote-center">&#x7EB8;&#x4E0A;&#x5F97;&#x6765;&#x7EC8;&#x89C9;&#x6D45;&#xFF0C;&#x7EDD;&#x77E5;&#x6B64;&#x4E8B;&#x8981;&#x8EAC;&#x884C;&#x3002;<br> &#x300A;&#x51AC;&#x591C;&#x8BFB;&#x4E66;&#x793A;&#x5B50;&#x807F;&#x300B;&#x2014;&#x2014; <strong>&#x9646;&#x6E38;</strong></blockquote>


<blockquote>
<p>20&#x5C81;&#x5230;30&#x5C81;&#x8FD9;&#x5341;&#x5E74;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5341;&#x5E74;&#xFF0C;&#x4F60;&#x8981;&#x786E;&#x5B9A;&#x81EA;&#x5DF1;&#x7684;&#x4E16;&#x754C;&#x89C2;&#x3001;&#x4EF7;&#x503C;&#x89C2;&#xFF0C;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x4EBA;&#x751F;&#x4F34;&#x4FA3;&#xFF0C;&#x6162;&#x6162;&#x5B9A;&#x4E0B;&#x6765;&#xFF0C;&#x53EF;&#x662F;&#x8FD9;&#x5176;&#x95F4;&#x5145;&#x6EE1;&#x4E86;&#x632B;&#x6298;&#x3001;&#x6000;&#x7591;&#x548C;&#x56F0;&#x60D1;&#x3002;<br>25&#x5C81;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x548C;&#x6211;&#x4E00;&#x6837;&#xFF0C;&#x5145;&#x6EE1;&#x4E86;&#x5404;&#x79CD;&#x5343;&#x5947;&#x767E;&#x602A;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x60F3;&#x8981;&#x53BB;&#x95EF;&#x8361;&#x7684;&#x5FC3;&#xFF0C;&#x53EF;&#x7ED3;&#x679C;&#x603B;&#x662F;&#x6DF7;&#x6DF7;&#x5F53;&#x5F53;&#xFF0C;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x53EA;&#x662F;&#x505C;&#x7559;&#x5728;&#x4E86;&#x201C;&#x60F3;&#x201D;&#x7684;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x4ECA;&#x6211;&#x5DF2;&#x5F00;&#x59CB;&#x5954;&#x4E09;&#xFF0C;&#x597D;&#x591A;&#x4E8B;&#x60C5;&#x8FD8;&#x6CA1;&#x6709;&#x6765;&#x5F97;&#x53CA;&#x505A;&#xFF0C;&#x597D;&#x591A;&#x60F3;&#x6CD5;&#x4E5F;&#x65E9;&#x5DF2;&#x6CEF;&#x706D;&#xFF0C;&#x6211;&#x4E0D;&#x8981;&#x518D;&#x8FC7;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x6211;&#x60F3;&#x6539;&#x53D8;&#xFF0C;&#x6210;&#x4E3A;&#x66F4;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#xFF01;</p>
<p>&#x5982;&#x679C;&#x56DE;&#x5230;25&#x5C81;&#x6216;&#x8005;&#x66F4;&#x5E74;&#x8F7B;&#x53C8;&#x6216;&#x8005;&#x5BF9;&#x73B0;&#x5728;&#x7684;&#x4F60;&#xFF0C;&#x4F60;&#x60F3;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x8981;&#x600E;&#x4E48;&#x505A;&#xFF1F; Good luck and make it count .</p>
</blockquote>
<p>&#x5F53;&#x6211;&#x6B65;&#x5165;26&#x5C81;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x65F6;&#x95F4;&#x8D8A;&#x8FC7;&#x8D8A;&#x5FEB;&#xFF0C;&#x597D;&#x591A;&#x4E8B;&#x60C5;&#x518D;&#x4E0D;&#x505A;&#x5C31;&#x6765;&#x4E0D;&#x53CA;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x535A;&#x5BA2;&#xFF0C;&#x8BB0;&#x5F55;&#x81EA;&#x5DF1;&#x8FD9;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#x7684;&#x5386;&#x7A0B;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x5FE0;&#x4E8E;&#x81EA;&#x5DF1;&#xFF0C;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#xFF0C;&#x6BD5;&#x4E1A;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;10&#x5E74;&#x662F;&#x79EF;&#x7D2F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x671F;&#x95F4;&#x9700;&#x8981;&#x6162;&#x6162;&#x6539;&#x53D8;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x65B9;&#x6CD5;&#xFF0C;&#x79EF;&#x7D2F;&#x884C;&#x4E1A;&#x77E5;&#x8BC6;&#xFF0C;&#x8BA4;&#x8BC6;&#x884C;&#x4E1A;&#x725B;&#x4EBA;&#xFF0C;&#x672C;&#x535A;&#x5BA2;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x79EF;&#x7D2F;&#xFF1A;&#x6C47;&#x603B;&#x65E5;&#x5E38;&#x6240;&#x5B66;&#xFF0C;&#x5206;&#x4EAB;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#xFF0C;&#x6574;&#x7406;&#x7F51;&#x7EDC;&#x8D44;&#x6599;&#xFF0C;&#x5FE0;&#x4E8E;&#x81EA;&#x5DF1;&#xFF0C;&#x5FE0;&#x4E8E;&#x7406;&#x60F3;&#xFF01;</p>
<h2 id="&#x5173;&#x4E8E;-xirong">&#x5173;&#x4E8E; xirong</h2><hr>
<p>&#x4ECB;&#x7ECD;&#x81EA;&#x5DF1;&#x662F;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5B83;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4F60;&#x628A;&#x81EA;&#x5DF1;&#x5B9A;&#x4F4D;&#x6210;&#x4EC0;&#x4E48;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4F60;&#x60F3;&#x8FC7;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x8FD8;&#x610F;&#x5473;&#x7740;&#x4E00;&#x65E6;&#x4F60;&#x505A;&#x51FA;&#x4ECB;&#x7ECD;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x5C31;&#x5C40;&#x9650;&#x4E8E;&#x6B64;&#xFF0C;&#x56E0;&#x4E3A;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x90FD;&#x6CA1;&#x6709;&#x60F3;&#x6E05;&#x695A;&#x300C;<strong>&#x6211;&#x662F;&#x8C01;</strong>&#x300D;&#x8FD9;&#x4E2A;&#x56F0;&#x96BE;&#x7684;&#x54F2;&#x5B66;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x65AD;&#x7684;&#x7ED9;&#x81EA;&#x5DF1;&#x6253; tag&#xFF0C;&#x8BA9;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6807;&#x7B7E;&#x6765;&#x6765;&#x6A21;&#x7CCA;&#x7684;&#x5F62;&#x6210;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x540D;&#x5B57;&#x53EB; &#x300C;<code>xirong</code>&#x300D;</p>
<blockquote>
<p>89&#x5E74;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x3001;&#x963F;&#x91CC;&#x3001;&#x5DE5;&#x7A0B;&#x5E08;&#x3001;&#x7A0B;&#x5E8F;&#x733F;&#x3001;java&#x3001;net&#x3001;C#&#x3001;js&#x3001;&#x524D;&#x7AEF;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x3001;&#x67B6;&#x6784;&#x3001;Nosql&#x3001;Git&#x3001;Github&#x3001;&#x5F00;&#x6E90;&#x3001;&#x5168;&#x6808; &#x3001;&#x97F3;&#x4E50;&#x3001;&#x7535;&#x5F71;&#x3001;&#x7F8E;&#x5267;&#x3001;&#x9605;&#x8BFB;&#x3001;&#x5386;&#x53F2;&#x3001;&#x6B66;&#x4FA0;&#x3001;&#x72D7;&#x3001;&#x5199;&#x4F5C;&#x3001;&#x72EC;&#x7ACB;&#x535A;&#x4E3B;&#x3001;&#x8DD1;&#x6B65;&#x3001;&#x6E38;&#x6CF3;&#x3001;Apple&#x3001;Android&#x3001;APP&#x3001;&#x7535;&#x5B50;&#x8BBE;&#x5907;&#x3001;&#x6DF3;&#x6734;&#x3001;&#x6781;&#x7B80; &#x3001;&#x6548;&#x7387;&#x3001;&#x654F;&#x6377;&#x4E2A;&#x4EBA;&#x3001;&#x65F6;&#x95F4;&#x7BA1;&#x7406;</p>
</blockquote>
<blockquote><p>&#x6BCF;&#x4E2A;&#x5E73;&#x51E1;&#x7684;&#x4EBA;&#x90FD;&#x6709;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x6C89;&#x9ED8;&#x7684;&#x65F6;&#x5149;&#xFF0C;&#x9ED8;&#x9ED8;&#x7684;&#x52AA;&#x529B;&#x7740;&#xFF0C;&#x5FCD;&#x53D7;&#x5B64;&#x72EC;&#x4E0E;&#x5BC2;&#x5BDE;&#xFF0C;&#x6CA1;&#x6709;&#x62B1;&#x6028;&#xFF0C;&#x6CA1;&#x6709;&#x8BC9;&#x82E6;&#xFF0C;&#x90A3;&#x6BB5;&#x8FDE;&#x81EA;&#x5DF1;&#x56DE;&#x5FC6;&#x8D77;&#x6765;&#x90FD;&#x611F;&#x52A8;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x503C;&#x5F97;&#x8BB0;&#x5F55;&#xFF0C;&#x94ED;&#x8BB0;&#x5FC3;&#x4E2D;&#x3002;&#x52AA;&#x529B;&#x7684;&#x53BB;&#x505A;&#xFF0C;&#x53BB;&#x5C1D;&#x8BD5;&#x66F4;&#x591A;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x4E0D;&#x8F9C;&#x8D1F;&#x5E74;&#x8F7B;&#xFF0C;&#x5FE0;&#x4E8E;&#x81EA;&#x5DF1;&#xFF0C;&#x5FE0;&#x4E8E;&#x7406;&#x60F3;&#xFF01;<br>Try a better life , you deserve more !</p>
<footer><strong>xirong</strong><cite>Try to be free</cite></footer></blockquote>
<h2 id="&#x516C;&#x76CA;&#x6D3B;&#x52A8;">&#x516C;&#x76CA;&#x6D3B;&#x52A8;</h2><hr>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x516C;&#x76CA;&#xFF1F;&#x5728;&#x6211;&#x957F;&#x5927;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x65E0;&#x6570;&#x7684;&#x4EBA;&#x5E2E;&#x52A9;&#x8FC7;&#x6211;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x5C31;&#x60F3;&#x7740;&#x5C06;&#x6765;&#x4E00;&#x5B9A;&#x8981;&#x56DE;&#x62A5;&#x4ED6;&#x4EBA;&#xFF0C;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x6765;&#x5F97;&#x53CA;&#x505A;&#x3002;&#x5F53;&#x6211;&#x770B;&#x5230;&#x300A;<a href="http://movie.douban.com/subject/25835293/" target="_blank" rel="external">&#x5931;&#x5B64;</a>&#x300B;&#x300A;<a href="http://movie.douban.com/subject/25798222/" target="_blank" rel="external">&#x4EB2;&#x7231;&#x7684;</a>&#x300B;&#x5C24;&#x5176;&#x662F;&#x770B;&#x5B8C;&#x300A;<a href="http://www.iqiyi.com/v_19rrnokglg.html#vfrm=2-3-0-1" target="_blank" rel="external">&#x5931;&#x5B64;&#x80CC;&#x540E;&#x7684;&#x6545;&#x4E8B;</a>&#x300B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x60F3;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x662F;&#x4E2A;&#x5951;&#x673A;&#xFF0C;&#x5E94;&#x8BE5;&#x5C31;&#x4ECE;&#x6B64;&#x523B;&#x505A;&#x8D77;&#x6765;&#xFF0C;&#x8981;&#x575A;&#x4FE1;&#x4E16;&#x754C;&#x4E4B;&#x5927;&#xFF0C;&#x53EA;&#x8981;&#x6BCF;&#x4E2A;&#x50CF;&#x6211;&#x8FD9;&#x4E00;&#x6837;&#x7684;&#x5C0F;&#x4EBA;&#x7269;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x6539;&#x53D8;&#xFF0C;&#x4E16;&#x754C;&#x5C31;&#x4F1A;&#x7F8E;&#x597D;&#x4E00;&#x70B9;&#xFF0C;&#x6B63;&#x5728;&#x9605;&#x8BFB;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x4E0E;&#x6211;&#x4E00;&#x8D77;&#xFF0C;&#x53C2;&#x4E0E;&#x5230;&#x516C;&#x76CA;&#x4E2D;&#x6765;&#xFF0C;&#x8BA9;&#x6B64;&#x4E8B;&#x6210;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x4E00;&#x8D77;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x9700;&#x8981;&#x5E2E;&#x52A9;&#x7684;&#x4EBA;&#xFF01;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x4E3A;&#x4E16;&#x754C;&#x66F4;&#x7F8E;&#x597D;&#x4E00;&#x70B9;&#x800C;&#x7F8E;&#x4E3D;&#xFF01;&#x7B80;&#x5355;&#x4ECE;&#x4E8B;&#x516C;&#x76CA;&#x7684;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li><a href="http://gongyi.qq.com/" target="_blank" rel="external">&#x817E;&#x8BAF;&#x516C;&#x76CA;</a> &#xFF08;&#x6708;&#x6350;&#x3001;&#x9879;&#x76EE;&#x6350;&#x52A9;&#x7B49;&#x6D3B;&#x52A8;&#xFF09;&#xFF0C; &#x8FD9;&#x4E2A;&#x548C;&#x5FAE;&#x4FE1;&#x300C;&#x516C;&#x76CA;&#x884C;&#x300D;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</li>
<li>&#x5FAE;&#x4FE1;&#x8FD0;&#x52A8; - &#x884C;&#x52A8;&#x6350;&#xFF08;&#x5173;&#x6CE8;&#x300C;&#x5FAE;&#x4FE1;&#x8FD0;&#x52A8;&#x300D;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x70B9;&#x51FB;&#x8FD0;&#x52A8;&#x6350;&#x52A9;&#x5373;&#x53EF;&#xFF09;&#xFF0C;&#x5173;&#x6CE8;&#x300C;&#x516C;&#x76CA;&#x884C;&#x300D;&#x516C;&#x4F17;&#x53F7;&#x6709;&#x66F4;&#x591A;&#x7684;&#x516C;&#x76CA;&#x6D3B;&#x52A8;</li>
<li>&#x652F;&#x4ED8;&#x5B9D; - &#x7231;&#x5FC3;&#x6350;&#x8D60;&#xFF08;&#x6253;&#x5F00;&#x652F;&#x4ED8;&#x5B9D;&#xFF0C;&#x627E;&#x5230;&#x7231;&#x5FC3;&#x6350;&#x8D60;&#xFF0C;&#x9009;&#x62E9;&#x4F60;&#x60F3;&#x8981;&#x81EA;&#x52A9;&#x7684;&#x9879;&#x76EE;&#x5373;&#x53EF;&#xFF09;</li>
<li><a href="http://now.taobao.com/" target="_blank" rel="external">&#x963F;&#x91CC;&#x516C;&#x76CA; - &#x5929;&#x5929;&#x6B63;&#x80FD;&#x91CF;</a></li>
</ul>
<h2 id="&#x6211;&#x6B63;&#x5728;&#x575A;&#x6301;&#x7684;&#x884C;&#x52A8;~">&#x6211;&#x6B63;&#x5728;&#x575A;&#x6301;&#x7684;&#x884C;&#x52A8;~</h2><hr>
<ul>
<li>100&#x5929;&#x884C;&#x52A8;&#x8BA1;&#x5212; &#x4E4B; &#x300C;&#x53D1;&#x73B0;&#x751F;&#x6D3B;&#x4E4B;&#x7F8E;&#x300D;&#xFF0C;&#x6BCF;&#x65E5;&#x4E00;&#x5F20;&#x56FE; <a href="https://instagram.com/ixirong/" target="_blank" rel="external">&#x6211;&#x7684;Instagram&#x5730;&#x5740;</a></li>
<li>30&#x5929;&#x6311;&#x6218;&#x6BCF;&#x65E5;&#x8D21;&#x732E; github &#x5185;&#x5BB9; <a href="https://github.com/xirong" target="_blank" rel="external">&#x6211;&#x7684;GitHub&#x5730;&#x5740;</a></li>
<li>&#x5F00;&#x59CB;&#x654F;&#x6377;&#x4E2A;&#x4EBA;&#x8BA1;&#x5212;&#xFF0C;&#x8BE6;&#x60C5;&#x89C1; <a href="http://www.zhoujingen.cn/blog/" target="_blank" rel="external">&#x5468;&#x91D1;&#x6839;&#x72EC;&#x7ACB;&#x535A;&#x5BA2;</a>&#xFF0C;&#x4E5F;&#x63A8;&#x8350;&#x5404;&#x4F4D;&#x52A0;&#x5165;&#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x6539;&#x53D8;</li>
<li>&#x6211;&#x7684; Mooc &#x5B66;&#x4E60;&#x8BA1;&#x5212;</li>
<li>&#x2026;&#x2026;</li>
</ul>
<h2 id="one-more-thing">One more thing &#x2026;&#x2026;</h2><hr>
<p>&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x4F60;&#x90FD;&#x8981;&#x8BB0;&#x4F4F; <code>xirong</code> &#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x7684;&#x7F51;&#x7EDC; ID&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x4E0A;&#x9762;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x53EF;&#x5728;&#x6D3B;&#x751F;&#x751F;&#x7684;&#x4E16;&#x754C;&#x91CC;&#x9762;&#xFF0C;&#x5374;&#x771F;&#x5B9E;&#x7684;&#x751F;&#x5B58;&#x7740;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x6709;&#x7740;&#x535A;&#x6587;&#x4E2D;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x548C;&#x4E00;&#x4E9B;&#x72EC;&#x7279;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x7684;&#x884C;&#x8D70;&#x5728;&#x8FD9;&#x6761;&#x8270;&#x96BE;&#x7684;&#x4EBA;&#x751F;&#x8DEF;&#x4E0A;&#xFF0C;&#x52AA;&#x529B;&#x8DDF;&#x968F;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5FC3;&#xFF0C;&#x53BB;&#x8FFD;&#x6C42;&#x7406;&#x60F3;&#x4E2D;&#x7684;&#x751F;&#x6D3B;&#xFF1B; <code>xirong</code> &#x662F;&#x8C01;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x82B8;&#x82B8;&#x4F17;&#x751F;&#x4E2D;&#x6709;&#x90A3;&#x4E48;&#x4E00;&#x6279;&#x4EBA;&#xFF0C;&#x6709;&#x6240;&#x60F3;&#x6709;&#x6240;&#x505A;&#xFF0C;&#x4E0D;&#x7126;&#x4E0D;&#x71E5;&#xFF0C;&#x5FE0;&#x4E8E;&#x81EA;&#x5DF1;&#xFF0C;&#x5FE0;&#x4E8E;&#x7406;&#x60F3;&#xFF0C;&#x4E0D;&#x65AD;&#x7A81;&#x7834;&#x7740;&#x3001;&#x575A;&#x5B88;&#x7740;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x770B;&#x5230;&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x6587;&#x5B57;&#x4F1A;&#x4EA7;&#x751F;&#x5171;&#x9E23;&#xFF0C;&#x5F15;&#x8D77;&#x6539;&#x53D8;&#xFF0C;&#x8FDB;&#x800C;&#x5C06;&#x8FD9;&#x79CD;&#x6539;&#x53D8;&#x5E26;&#x7ED9;&#x8EAB;&#x8FB9;&#x7684;&#x4EBA;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x66F4;&#x52A0;&#x7F8E;&#x597D;&#xFF0C;&#x8FD9;&#x662F;&#x5E73;&#x51E1;&#x7684;&#x529B;&#x91CF;&#xFF01; &#x4E00;&#x4E2A;&#x5E73;&#x51E1;&#x7684;&#x4EBA;&#xFF0C;&#x7528; <code>xirong</code> &#x8FD9;&#x4E2A; ID &#x6446;&#x5F04;&#x7740;&#x4E00;&#x4E9B;&#x6587;&#x5B57;&#xFF0C;&#x5F71;&#x54CD;&#x7740;&#x4E00;&#x4E9B;&#x4EBA;&#xFF0C;&#x8FD9;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x2026;&#x2026;</p>
<h2 id="&#x8054;&#x7CFB;-xirong">&#x8054;&#x7CFB; xirong</h2><hr>
<ul>
<li><a href="http://weixin.sogou.com/weixin?type=1&amp;query=Geek_Notes&amp;ie=utf8&amp;w=01019900&amp;sut=4856&amp;sst0=1451527213494&amp;lkt=1%2C1451527211738%2C1451527211738" target="_blank" rel="external">&#x5FAE;&#x4FE1;</a></li>
<li><a href="http://weibo.com/jackieliuxirong" target="_blank" rel="external">&#x5FAE;&#x535A;</a></li>
<li><a href="https://github.com/xirong/" target="_blank" rel="external">GitHub</a></li>
<li><a href="mailto:ixirong.liu@gmail.com" target="_blank" rel="external">MailMe(&#x90AE;&#x4EF6;&#x8054;&#x7CFB;)</a></li>
</ul>
<p>&#x4E0E;&#x6211;&#x4E00;&#x8D77;&#xFF0C;&#x8046;&#x542C;&#x8FD9;&#x9996; Beyond &#x7684;&#x300A;&#x6D77;&#x9614;&#x5929;&#x7A7A;&#x300B;&#xFF0C;&#x611F;&#x53D7;&#x5185;&#x5FC3;&#x6DF1;&#x5904;&#x7684;&#x89E6;&#x52A8; ~</p>
<iframe frameborder="no" border="0" marginwidth="0" marginheight="0" width="330" height="86" src="http://music.163.com/outchain/player?type=2&amp;id=347230&amp;auto=0&amp;height=66"></iframe>
    
  </div>


          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel  sidebar-panel-active ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/xirong.jpg"
               alt="xirong" />
          <p class="site-author-name" itemprop="name">xirong</p>
          <p class="site-description motion-element" itemprop="description">思考生活，分享故事</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">62</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">20</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">93</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="http://weixin.sogou.com/weixin?type=1&query=Geek_Notes&ie=utf8&w=01019900&sut=4856&sst0=1451527213494&lkt=1%2C1451527211738%2C1451527211738" target="_blank" title="wechat">
                  
                    <i class="fa fa-fw fa-weixin"></i>
                  
                  wechat
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/jackieliuxirong" target="_blank" title="weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/xirong/" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              推荐阅读
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.zhoujingen.cn/blog/" title="敏捷个人" target="_blank">敏捷个人</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.ruanyifeng.com/blog/" title="阮一峰" target="_blank">阮一峰</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://coolshell.cn/" title="酷壳" target="_blank">酷壳</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.read.org.cn/" title="战隼" target="_blank">战隼</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.mifengtd.cn/" title="褪墨" target="_blank">褪墨</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://mindhacks.cn/" title="刘未鹏" target="_blank">刘未鹏</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://ddimples.github.io/" title="程小黑" target="_blank">程小黑</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.javachen.com/" title="JavaChen" target="_blank">JavaChen</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2014 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xirong</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="powered-by">
  <div style="float:left;margin-top:7px;margin-right:10px;">
  <script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1254711542'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s11.cnzz.com/z_stat.php%3Fid%3D1254711542%26show%3Dpic' type='text/javascript'%3E%3C/script%3E"));</script>
  </div>
   鲁ICP备15013969号
</div>

<div class="theme-info">
  Clone theme -
  <a class="theme-link" href="https://github.com/xirong/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xirong"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("HfEUHBkxIxPKFFWsM8E29K81-gzGzoHsz", "j8gTHCF5cxmeGRbV0QIujeUw");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script>


</body>
</html>
