<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />









  <meta name="360-site-verification" content="2ebfa6bfe0988ac65c00405e3012ab01" />




  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="2016阅读,互联网,读书笔记," />





  <link rel="alternate" href="/atom.xml" title="自由" type="application/atom+xml" />









<meta name="description" content="​互联网老兵周鸿祎的《我的互联网方法论》读书笔记
尝试用一句话总结这本书的内容：商业应该回归到以人为核心的本质，用户至上、体验为王，免费的商业模式以及颠覆性创新。
书中的几个核心观点：">
<meta property="og:type" content="article">
<meta property="og:title" content="《我的互联网方法论》笔记">
<meta property="og:url" content="http://www.ixirong.com/2016/01/03/book-zhouhongyi-thinking-of-internet/index.html">
<meta property="og:site_name" content="自由">
<meta property="og:description" content="​互联网老兵周鸿祎的《我的互联网方法论》读书笔记
尝试用一句话总结这本书的内容：商业应该回归到以人为核心的本质，用户至上、体验为王，免费的商业模式以及颠覆性创新。
书中的几个核心观点：">
<meta property="og:image" content="http://img3.doubanio.com/lpic/s27331559.jpg">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《我的互联网方法论》笔记">
<meta name="twitter:description" content="​互联网老兵周鸿祎的《我的互联网方法论》读书笔记
尝试用一句话总结这本书的内容：商业应该回归到以人为核心的本质，用户至上、体验为王，免费的商业模式以及颠覆性创新。
书中的几个核心观点：">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: 'xirong'
    }
  };
</script>

  <title> 《我的互联网方法论》笔记 | 自由 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">自由</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-heartbeat"></i> <br />
            
            公益404
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="st-search-show-outputs">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <form class="site-search-form">
  <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
</form>

<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'CMcqT-2yt1yatw_zFhNC','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                《我的互联网方法论》笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-01-03T18:18:53+08:00" content="2016-01-03">
              2016-01-03
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/读书笔记/" itemprop="url" rel="index">
                    <span itemprop="name">读书笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/01/03/book-zhouhongyi-thinking-of-internet/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/01/03/book-zhouhongyi-thinking-of-internet/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/01/03/book-zhouhongyi-thinking-of-internet/" class="leancloud_visitors" data-flag-title="《我的互联网方法论》笔记">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="http://img3.doubanio.com/lpic/s27331559.jpg" alt="book"></p>
<p>&#x200B;&#x4E92;&#x8054;&#x7F51;&#x8001;&#x5175;&#x5468;&#x9E3F;&#x794E;&#x7684;&#x300A;&#x6211;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x65B9;&#x6CD5;&#x8BBA;&#x300B;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;</p>
<p>&#x5C1D;&#x8BD5;&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x603B;&#x7ED3;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5185;&#x5BB9;&#xFF1A;&#x5546;&#x4E1A;&#x5E94;&#x8BE5;&#x56DE;&#x5F52;&#x5230;&#x4EE5;&#x4EBA;&#x4E3A;&#x6838;&#x5FC3;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x7528;&#x6237;&#x81F3;&#x4E0A;&#x3001;&#x4F53;&#x9A8C;&#x4E3A;&#x738B;&#xFF0C;&#x514D;&#x8D39;&#x7684;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x4EE5;&#x53CA;&#x98A0;&#x8986;&#x6027;&#x521B;&#x65B0;&#x3002;</p>
<p>&#x4E66;&#x4E2D;&#x7684;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x89C2;&#x70B9;&#xFF1A;<br><a id="more"></a></p>
<ol>
<li>&#x8D8B;&#x52BF;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x7269;&#x7684;&#x53D1;&#x5C55;&#x62B5;&#x4E0D;&#x8FC7;&#x8D8B;&#x52BF;&#xFF08;&#x5386;&#x53F2;&#x7684;&#x8D8B;&#x52BF;&#xFF09;<br>&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x4EA7;&#x54C1;&#xFF0C;&#x672C;&#x8D28;&#x662F;&#x901A;&#x8FC7;&#x4EA7;&#x54C1;&#x4E3A;&#x7528;&#x6237;&#x521B;&#x9020;&#x4EF7;&#x503C;&#xFF0C;&#x5305;&#x62EC;&#x4EA7;&#x54C1;&#x6A21;&#x5F0F;&#x3001;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x3001;&#x63A8;&#x5E7F;&#x6A21;&#x5F0F;&#x548C;&#x6536;&#x5165;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E16;&#x4EBA;&#x60F3;&#x5230;&#x63D0;&#x5230;&#x7684;&#x201C;&#x8D5A;&#x94B1;&#x6A21;&#x5F0F;&#x201D;&#x3002;</li>
<li>&#x4E92;&#x8054;&#x7F51;&#x601D;&#x7EF4;&#x7684;&#x672C;&#x8D28;&#x662F;&#x7528;&#x6237;&#x81F3;&#x4E0A;&#xFF0C;&#x53EA;&#x6709;&#x4E3A;&#x4F7F;&#x7528;&#x4F60;&#x4EA7;&#x54C1;&#x7684;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x8DB3;&#x591F;&#x7CBE;&#x81F4;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x91CF;&#x589E;&#x591A;&#x540E;&#xFF0C;&#x624D;&#x4F1A;&#x51FA;&#x73B0;&#x5BA2;&#x6237;&#xFF08;&#x4E3A;&#x4EA7;&#x54C1;&#x7684;&#x589E;&#x503C;&#x670D;&#x52A1;&#x4ED8;&#x8D39;&#x7684;&#x4EBA;&#xFF09;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x7684;&#x672C;&#x8D28;&#x662F;&#x4E3A;&#x7528;&#x6237;&#x670D;&#x52A1;&#xFF0C;&#x89E3;&#x51B3;&#x75DB;&#x70B9;&#x3002;</li>
<li>&#x98A0;&#x8986;&#x5F0F;&#x521B;&#x65B0;&#xFF0C;&#x4ECE;&#x65E0;&#x5230;&#x6709;&#x7684;&#x521B;&#x65B0;&#xFF08;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#xFF09;&#xFF0C;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x521B;&#x65B0;&#xFF08;&#x6536;&#x8D39;-&#x514D;&#x8D39;&#xFF09;&#xFF0C;&#x4EA7;&#x54C1;&#x4F53;&#x9A8C;&#x7684;&#x521B;&#x65B0;&#xFF08;&#x590D;&#x6742;-&#x7B80;&#x5355;&#xFF09;&#x3002;&#x521B;&#x65B0;&#x9700;&#x8981;&#x9006;&#x5411;&#x601D;&#x7EF4;&#xFF0C;&#x53CD;&#x5411;&#x64CD;&#x4F5C;&#xFF08;&#x201C;think different&#x201D;&#xFF09;</li>
<li>&#x514D;&#x8D39;&#xFF08;free&#xFF09;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x7684;&#x7CBE;&#x9AD3;&#xFF0C;&#x514D;&#x8D39;&#x5E26;&#x6765;&#x5FE0;&#x8BDA;&#x7684;&#x7528;&#x6237;&#x7FA4;&#xFF0C;&#x514D;&#x8D39;&#x8BA9;&#x7528;&#x6237;&#x611F;&#x89C9;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x81EA;&#x5728;&#x3001;&#x4FBF;&#x5229;&#x3002;&#x514D;&#x8D39;&#x662F;&#x4E00;&#x79CD;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#xFF0C;&#x901A;&#x8FC7;&#x514D;&#x8D39;&#x83B7;&#x53D6;&#x5927;&#x91CF;&#x6D77;&#x91CF;&#x7684;&#x7528;&#x6237;&#x7FA4;&#xFF0C;&#x5728;&#x8FD9;&#x4E4B;&#x4E0A;&#x8FDB;&#x884C;&#x5E7F;&#x544A;/&#x63D0;&#x4F9B;&#x589E;&#x503C;&#x670D;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x7F51;&#x6E38;&#x3002;</li>
<li>&#x514D;&#x8D39;&#x4E4B;&#x540E;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#x94FE;&#x3001;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x3001;&#x8DE8;&#x754C;&#xFF0C;&#x6BD4;&#x5982;&#x5C0F;&#x7C73;&#x7684;&#x624B;&#x673A;&#x3001;&#x667A;&#x80FD;&#x5BB6;&#x5C45;&#xFF0C;360&#x7684;&#x6740;&#x6BD2;&#x540E;&#x624B;&#x673A;&#x3001;&#x513F;&#x7AE5;&#x4EA7;&#x54C1;&#x7B49;&#x3002;<br>&#x4F53;&#x9A8C;&#x4E3A;&#x738B;&#xFF0C;&#x4EA7;&#x54C1;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#xFF0C;&#x6CE8;&#x91CD;&#x7EC6;&#x8282;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x6BD4;&#x5982;&#x82F9;&#x679C;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x8FDB;&#x5165;&#x4F53;&#x9A8C;&#x7ECF;&#x6D4E;&#x65F6;&#x4EE3;&#x3002;</li>
</ol>
<p>&#x4E66;&#x4E2D;&#x63A8;&#x8350;&#x9605;&#x8BFB;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x5173;&#x4E8E;&#x98A0;&#x8986;&#x5F0F;&#x521B;&#x65B0;&#x7684;&#x7406;&#x8BBA;&#x4E0E;&#x5B9E;&#x8DF5;</p>
<ol>
<li>&#x300A;&#x521B;&#x65B0;&#x8005;&#x7684;&#x7A98;&#x5883;&#x300B;&#x8C46;&#x74E3;8.5&#x5206; <a href="http://book.douban.com/subject/4243770/" target="_blank" rel="external">http://book.douban.com/subject/4243770/</a></li>
<li>&#x300A;&#x67D4;&#x9053;&#x6218;&#x7565;&#x300B; &#x8C46;&#x74E3;8.1&#x5206; <a href="http://book.douban.com/subject/1104943/" target="_blank" rel="external">http://book.douban.com/subject/1104943/</a></li>
<li>&#x300A;&#x5B9A;&#x4F4D;&#x300B;&#x8C46;&#x74E3;8.3&#x5206; <a href="http://book.douban.com/subject/1017180/" target="_blank" rel="external">http://book.douban.com/subject/1017180/</a></li>
</ol>
<h2 id="&#x4EE5;&#x4E0B;&#x662F;&#x4E66;&#x4E2D;&#x5185;&#x5BB9;&#x90E8;&#x5206;&#x6458;&#x6284;">&#x4EE5;&#x4E0B;&#x662F;&#x4E66;&#x4E2D;&#x5185;&#x5BB9;&#x90E8;&#x5206;&#x6458;&#x6284;&#xFF1A;</h2><p>&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x4F60;&#x80FD;&#x63D0;&#x4F9B;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x7ED9;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7528;&#x6237;&#x521B;&#x9020;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5728;&#x521B;&#x9020;&#x7528;&#x6237;&#x4EF7;&#x503C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x5408;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5305;&#x62EC;&#x516C;&#x53F8;&#x505A;&#x4EC0;&#x4E48;&#x4EA7;&#x54C1;&#x3001;&#x5B9A;&#x4F4D;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5BA2;&#x6237;&#x3001;&#x7528;&#x4EC0;&#x4E48;&#x5E02;&#x573A;&#x8425;&#x9500;&#x624B;&#x6CD5;&#xFF0C;&#x8D62;&#x5229;&#x6A21;&#x5F0F;&#x53EA;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x5F97;&#x6C11;&#x5FC3;&#x8005;&#x5F97;&#x5929;&#x4E0B;&#xFF0C;&#x6CA1;&#x6709;&#x7528;&#x6237;&#x4EF7;&#x503C;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x5546;&#x4E1A;&#x4EF7;&#x503C;&#xFF01; &#x4F60;&#x5E94;&#x8BE5;&#x56DE;&#x7B54;&#x6E05;&#x695A;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4F60;&#x7A76;&#x7ADF;&#x62FF;&#x4EC0;&#x4E48;&#x514D;&#x8D39;&#xFF1F;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x4F1A;&#x4E0D;&#x4F1A;&#x6210;&#x4E3A;&#x4E00;&#x9879;&#x57FA;&#x7840;&#x670D;&#x52A1;&#xFF1F;&#x901A;&#x8FC7;&#x514D;&#x8D39;&#x80FD;&#x4E0D;&#x80FD;&#x5F97;&#x5230;&#x7528;&#x6237;&#xFF1F;&#x5728;&#x5F97;&#x5230;&#x7528;&#x6237;&#x548C;&#x514D;&#x8D39;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x505A;&#x51FA;&#x65B0;&#x7684;&#x589E;&#x503C;&#x670D;&#x52A1;&#xFF1F;&#x589E;&#x503C;&#x670D;&#x52A1;&#x7684;&#x7528;&#x6237;&#x613F;&#x610F;&#x4ED8;&#x8D39;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x56DE;&#x7B54;&#x6E05;&#x695A;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x3002;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x53EA;&#x662F;&#x8D62;&#x5229;&#x6A21;&#x5F0F;&#x6682;&#x65F6;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;&#x5C31;&#x5426;&#x5B9A;&#x5B83;&#x7684;&#x6574;&#x4E2A;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x8BF4;&#x7528;&#x6237;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x53EA;&#x6709;&#x6C47;&#x805A;&#x4E86;&#x6D77;&#x91CF;&#x7528;&#x6237;&#x57FA;&#x6570;&#x624D;&#x53EF;&#x80FD;&#x8D5A;&#x94B1;&#xFF0C;&#x800C;&#x662F;&#x8BF4;&#x7528;&#x6237;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x73AF;&#x8282;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x9047;&#x5230;&#x521B;&#x4E1A;&#x8005;&#xFF0C;&#x6211;&#x90FD;&#x5F3A;&#x8C03;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x8981;&#x6EE1;&#x8111;&#x5B50;&#x60F3;&#x7740;&#x505A;&#x5E73;&#x53F0;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x5927;&#x516C;&#x53F8;&#x770B;&#x4E0D;&#x5230;&#x7684;&#x89D2;&#x843D;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x5E73;&#x53F0;&#x662F;&#x5927;&#x516C;&#x53F8;&#x73A9;&#x513F;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x98A0;&#x8986;&#x8981;&#x7684;&#x662F;&#x5FAE;&#x89C2;&#x529B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5E73;&#x53F0;&#x529B;&#x3002;&#x5E73;&#x53F0;&#x662F;&#x4EA7;&#x751F;&#x4E0D;&#x4E86;&#x98A0;&#x8986;&#x529B;&#x91CF;&#x7684;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x591F;&#x6210;&#x4E3A;&#x5E73;&#x53F0;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x89E3;&#x51B3;&#x7528;&#x6237;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x628A;&#x89C4;&#x6A21;&#x505A;&#x5927;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5E73;&#x53F0;&#x3002;&#x800C;&#x5BF9;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x6CA1;&#x6709;&#x8D44;&#x6E90;&#x3001;&#x6BD4;&#x8F83;&#x82E6;&#x903C;&#x7684;&#x521B;&#x4E1A;&#x8005;&#x6765;&#x8BB2;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x98A0;&#x8986;&#x529B;&#x6765;&#x81EA;&#x5FAE;&#x89C2;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6765;&#x81EA;&#x4FA7;&#x7FFC;&#xFF0C;&#x6765;&#x81EA;&#x8FB9;&#x7F18;&#xFF0C;&#x6765;&#x81EA;&#x628A;&#x8D44;&#x6E90;&#x805A;&#x7126;&#x5728;&#x4E00;&#x70B9;&#x4E0A;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x3002;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8BB2;&#xFF0C;&#x505A;&#x5F97;&#x7B80;&#x5355;&#x4E5F;&#x597D;&#xFF0C;&#x505A;&#x5F97;&#x4FBF;&#x5B9C;&#x4E5F;&#x597D;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6781;&#x81F4;&#x3002;&#xFF08; &#x5982;&#x540C;&#x79CB;&#x53F6;&#x8BF4;&#x7684;&#x5728;&#x7EBF;&#x6559;&#x80B2;&#xFF0C;&#x5C0F;&#x800C;&#x7F8E;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x53EF;&#x4EE5;&#x5173;&#x6CE8;&#x4E0B;&#x79CB;&#x53F6;&#xFF0C;&#x6B66;&#x6C49;&#x5927;&#x5B66;&#x7684;&#x6559;&#x5E08;&#x64C5;&#x957F; ppt&#xFF0C;&#x5982;&#x4ECA;&#x521B;&#x4E1A;&#x505A;&#x4E86;&#x5728;&#x7EBF;&#x6559;&#x80B2;&#xFF09;</p>
<p>&#x6587;&#x5316;&#x662F;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x9047;&#x5230;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x8111;&#x5B50;&#x91CC;&#x51FA;&#x6765;&#x7684;&#x672C;&#x80FD;&#x53CD;&#x5E94;&#x300C;&#x5584;&#x6076;&#x5224;&#x65AD;&#xFF0C;&#x662F;&#x975E;&#x6807;&#x51C6;&#x300D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6587;&#x5316;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x5C0F;&#x53D7;&#x5230;&#x7684;&#x6559;&#x80B2;&#xFF0C;&#x90FD;&#x662F;&#x4ECE;&#x4F17;&#x3002;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x5F88;&#x5728;&#x610F;&#x522B;&#x4EBA;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x7279;&#x7ACB;&#x72EC;&#x884C;&#x3001;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x3001;&#x6807;&#x65B0;&#x7ACB;&#x5F02;&#xFF0C;&#x7279;&#x522B;&#x5C11;&#x6570;&#x6D3E;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4E0D;&#x4F1A;&#x592A;&#x770B;&#x597D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E72;&#x7684;&#x662F;&#x4EBA;&#x4EBA;&#x90FD;&#x80FD;&#x770B;&#x660E;&#x767D;&#x7684;&#x4E8B;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x9760;&#x8C31;&#xFF0C;&#x6709;&#x524D;&#x9014;&#x3002;&#x4F46;&#x53EF;&#x60DC;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x89C9;&#x5F97;&#x6709;&#x524D;&#x9014;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5F80;&#x5F80;&#x6CA1;&#x6709;&#x524D;&#x9014;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4E2D;&#x56FD;&#x4E92;&#x8054;&#x7F51;&#x521B;&#x4E1A;&#x8005;&#x4E00;&#x662F;&#x521B;&#x65B0;&#x5EA6;&#x4E0D;&#x591F;&#x3002;&#x8111;&#x5B50;&#x91CC;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6CA1;&#x6709;&#x90A3;&#x79CD;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x540C;&#x8D28;&#x5316;&#x4E25;&#x91CD;&#x3002;&#x4E8C;&#x662F;&#x6DF1;&#x5EA6;&#x4E0D;&#x591F;&#x3002;&#x6211;&#x4EEC;&#x505A;&#x4E8B;&#xFF0C;&#x4E0D;&#x7531;&#x81EA;&#x4E3B;&#x5C31;&#x5F80;&#x5BBD;&#x91CC;&#x60F3;&#xFF0C;&#x597D;&#x50CF;&#x4EC0;&#x4E48;&#x90FD;&#x80FD;&#x5E72;&#x3002;&#x4F46;&#x8FD9;&#x4E48;&#x591A;&#x521B;&#x4E1A;&#x8005;&#xFF0C;&#x4F60;&#x8981;&#x80FD;&#x8131;&#x9896;&#x800C;&#x51FA;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x4E24;&#x79CD;&#x601D;&#x8DEF;&#xFF1A;&#x8981;&#x4E48;&#x662F;&#x8FDB;&#x5165;&#x5F88;&#x65B0;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x4EA7;&#x751F;&#x5F88;&#x65B0;&#x7684;&#x60F3;&#x6CD5;&#xFF1B;&#x8981;&#x4E48;&#x662F;&#x5728;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x60F3;&#x5F97;&#x6BD4;&#x522B;&#x4EBA;&#x6DF1;&#xFF0C;&#x60F3;&#x5230;&#x548C;&#x522B;&#x4EBA;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x8FFD;&#x6C42;&#x4E00;&#x79CD;&#x4EF7;&#x503C;&#x89C2;&#x7684;&#x591A;&#x5143;&#xFF0C;&#x4E0D;&#x80FD;&#x5BB9;&#x5FCD;think different&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5F53;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x7684;&#x60F3;&#x6CD5;&#x6CA1;&#x4EBA;&#x8D5E;&#x540C;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x5F88;&#x80C6;&#x602F;&#xFF0C;&#x4E0D;&#x6562;&#x53BB;&#x5C1D;&#x8BD5;&#xFF0C;&#x5F88;&#x96BE;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x6587;&#x5316;&#x6C1B;&#x56F4;&#x4E0B;&#x771F;&#x6B63;&#x521B;&#x65B0;&#x3002;&#x771F;&#x6B63;&#x521B;&#x65B0;&#x7684;&#x4EBA;&#x90FD;&#x4E0D;&#x4F1A;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x6709;&#x9C9C;&#x82B1;&#x548C;&#x638C;&#x58F0;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F80;&#x5F80;&#x4F1A;&#x88AB;&#x770B;&#x6210;&#x5F02;&#x7C7B;&#x3001;&#x5C11;&#x6570;&#x6D3E;&#x3001;&#x602A;&#x7269;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x88AB;&#x770B;&#x6210;&#x9EBB;&#x70E6;&#x5236;&#x9020;&#x8005;&#x3002;&#x4ED6;&#x4EEC;&#x8BF4;&#x7684;&#x8BDD;&#x4E0D;&#x88AB;&#x4EBA;&#x7406;&#x89E3;&#xFF0C;&#x505A;&#x7684;&#x4E8B;&#x4E0D;&#x88AB;&#x4EBA;&#x7406;&#x89E3;&#xFF0C;&#x4F46;&#x6700;&#x540E;&#x4ED6;&#x83B7;&#x5F97;&#x4E16;&#x4FD7;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x6539;&#x53D8;&#x4E86;&#x4E16;&#x754C;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x521B;&#x65B0;&#x7684;&#x82F1;&#x96C4;&#x3002;</p>
<p>&#x8001;&#x5468;&#x5BF9;&#x300A;&#x9057;&#x5931;&#x7684;&#x4E54;&#x5E03;&#x65AF;&#x8BBF;&#x8C08;&#x300B;&#x7684;&#x70B9;&#x8BC4; : <a href="http://weibo.com/1708942053/zajnvlxmI?type=comment#_rnd1451813251738" target="_blank" rel="external">&#x5FAE;&#x535A;&#x957F;&#x6587;</a> &#xFF0C;&#x6574;&#x4E2A;&#x91C7;&#x8BBF;&#x53EF;&#x4EE5;&#x5728; youku &#x4E0A;&#x770B;&#x5230; <a href="http://v.youku.com/v_show/id_XNDg1MjYxNjk2.html" target="_blank" rel="external">Steve Jobs The Lost Interview (Full Film)</a></p>
<iframe class="iframe-video" src="http://player.youku.com/embed/XNDg1MjYxNjk2" frameborder="0" allowfullscreen></iframe>
      
    </div>

    <div>
      
        
<div id="wechat_subscriber" style="display: block； padding: 10px 0; margin: 20px auto; width: 100%; text-align: center">
    <img id="wechat_subscriber_qcode" src="/uploads/GeekNotes.jpg" alt="xirong wechat" style="width: 200px; max-width: 100%;"/>
    <div>我在公众号与你分享更多内容</div>
</div>

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/2016阅读/" rel="tag">#2016阅读</a>
          
            <a href="/tags/互联网/" rel="tag">#互联网</a>
          
            <a href="/tags/读书笔记/" rel="tag">#读书笔记</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/12/26/using-qiniu-synctools/" rel="next" title="使用七牛开发者工具QRSBox上传文件">
                <i class="fa fa-chevron-left"></i> 使用七牛开发者工具QRSBox上传文件
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/01/04/intro-squid-proxy-server/" rel="prev" title="squid正向代理">
                squid正向代理 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/01/03/book-zhouhongyi-thinking-of-internet/"
           data-title="《我的互联网方法论》笔记" data-url="http://www.ixirong.com/2016/01/03/book-zhouhongyi-thinking-of-internet/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/xirong.jpg"
               alt="xirong" />
          <p class="site-author-name" itemprop="name">xirong</p>
          <p class="site-description motion-element" itemprop="description">思考生活，分享故事</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">62</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">20</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">93</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="http://weixin.sogou.com/weixin?type=1&query=Geek_Notes&ie=utf8&w=01019900&sut=4856&sst0=1451527213494&lkt=1%2C1451527211738%2C1451527211738" target="_blank" title="wechat">
                  
                    <i class="fa fa-fw fa-weixin"></i>
                  
                  wechat
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/jackieliuxirong" target="_blank" title="weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/xirong/" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              推荐阅读
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.zhoujingen.cn/blog/" title="敏捷个人" target="_blank">敏捷个人</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://macshuo.com/" title="MacTalk" target="_blank">MacTalk</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.ruanyifeng.com/blog/" title="阮一峰" target="_blank">阮一峰</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://coolshell.cn/" title="酷壳" target="_blank">酷壳</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.read.org.cn/" title="战隼" target="_blank">战隼</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://www.mifengtd.cn/" title="褪墨" target="_blank">褪墨</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://mindhacks.cn/" title="刘未鹏" target="_blank">刘未鹏</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://ddimples.github.io/" title="程小黑" target="_blank">程小黑</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://blog.javachen.com/" title="JavaChen" target="_blank">JavaChen</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#以下是书中内容部分摘抄"><span class="nav-number">1.</span> <span class="nav-text">以下是书中内容部分摘抄：</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2014 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">xirong</span>
</div>

<div class="powered-by">
  Powered by <a class="theme-link" href="http://hexo.io">Hexo</a>
</div>

<div class="powered-by">
  <div style="float:left;margin-top:7px;margin-right:10px;">
  <script type="text/javascript">var cnzz_protocol = (("https:" == document.location.protocol) ? " https://" : " http://");document.write(unescape("%3Cspan id='cnzz_stat_icon_1254711542'%3E%3C/span%3E%3Cscript src='" + cnzz_protocol + "s11.cnzz.com/z_stat.php%3Fid%3D1254711542%26show%3Dpic' type='text/javascript'%3E%3C/script%3E"));</script>
  </div>
   鲁ICP备15013969号
</div>

<div class="theme-info">
  Clone theme -
  <a class="theme-link" href="https://github.com/xirong/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"xirong"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  
  <script type="text/x-mathjax-config">
    MathJax.Hub.Config({
      tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
      }
    });
  </script>

  <script type="text/x-mathjax-config">
    MathJax.Hub.Queue(function() {
      var all = MathJax.Hub.getAllJax(), i;
      for (i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';
      }
    });
  </script>
  <script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>


  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("HfEUHBkxIxPKFFWsM8E29K81-gzGzoHsz", "j8gTHCF5cxmeGRbV0QIujeUw");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  
<script type="text/javascript" async src="//push.zhanzhang.baidu.com/push.js">
</script>


</body>
</html>
